//
// Created by Евпатов Михаил on 19.07.2021.
//

#ifndef UNTITLED2_MENU_H
#define UNTITLED2_MENU_H

//  Нужно написать меню, которое функционирует на основе проверки введенного
// пользователем значения, на осове чего делает переход в другие меню или
// вызывает нужные функции для экспорта, импорта или выбора файла.
//  В качестве проверяемого значения будет строка (std::string).
//
//  Работа меню выглядит примерно так:
//      1. Запускаем программу.
//      2. Выводим главное меню.
//      3. Предлагаем пользователю сделать выбор на индексов пунктов меню.
//      4. Пользователь вводит индекс пункта меню.
//
//          Главное меню
//  [1] Экспортировать файл.
//  [2] Импортировать файл.
//  [3] Выход.
//
//          Экспорт файла
//  [1] Выбрать файл для экспорта.
//  [2] Экспортировать.
//  [3] Вернуться в главное меню.
//
//          Импорт файла
//  [1] Выбрать файл для импорта.
//  [2] Импортировать.
//  [3] Вернуться в главное меню.
//
//  Проверить обработку ошибочного ввода.

#endif //UNTITLED2_MENU_H
